Repository: ibprovider/Lcpi.EFCore.LcpiOleDb
Catalog: Code/Provider/Source/ErrorServices/ErrMessageID.*.resx
Languages: ru

# msql_gen_err__failed_to_generate_create_index_statement__2
source: Failed to generate CREATE INDEX [name: %1][table: %2] statement.
ru: Ошибка генерации запроса CREATE INDEX [имя: %1][таблица: %2].

# msql_gen_err__bad_index_definition__multiple_data__2
source: Incorrect definition of index [name: %1][table: %2]. Definition contains multiple variants of data for indexing.
ru: Некорректное описание индекса [имя: %1][таблица: %2]. Указано несколько вариантов данных для индекcации.

# msql_gen_err__bad_index_definition__no_data__2
source: Incorrect definition of index [name: %1][table: %2]. No data for indexing.
ru: Некорректное описание индекса [имя: %1][таблица: %2]. Не указаны данные для индекcации.

# msql_gen_err__table_name_not_defined__0
source: Table name not defined.
ru: Не определено имя таблицы.

# type_mapping_err__cant_map_clr_type_to_provider_data_type_1
source: Can't map CLR-type [%1] to provider datatype.
ru: Невозможно отобразить CLR-тип [%1] на тип данных провайдера.

# type_mapping_err__cant_map_info_to_provider_data_type_2
source: Can't map description [clrType: %1].[baseTypeName: "%2"] to provider datatype.
ru: Невозможно отобразить описание [clrType: %1].[baseTypeName: "%2"] на тип данных провайдера.

# type_mapping_err__unknown_StoreTypeName_1
source: Unknown database datatype (StoreTypeName): [%1].
ru: Неизвестный тип данных БД (StoreTypeName): [%1].

# type_mapping_err__unknown_StoreTypeName_2
source: Unknown database datatype (StoreTypeName): [%1]. Linked column: [%2].
ru: Неизвестный тип данных БД (StoreTypeName): [%1]. Связанная колонка: [%2].

# type_mapping_err__unexpected_StoreTypeName_2
source: Unexpected value of mappingInfo.StoreTypeName: [%1]. Expected name: [%2].
ru: Недопустимое значение mappingInfo.StoreTypeName: [%1]. Ожидалось имя: [%2].

# type_mapping_err__unexpected_StoreTypeNameBase_2
source: Unexpected value of mappingInfo.StoreTypeNameBase: [%1]. Expected name: [%2].
ru: Недопустимое значение mappingInfo.StoreTypeNameBase: [%1]. Ожидалось имя: [%2].

# type_mapping_err__unexpected_Size_1
source: Unexpected value of mappingInfo.Size: %1.
ru: Недопустимое значение mappingInfo.Size: %1.

# type_mapping_err__not_defined_Size_0
source: mappingInfo.Size contains null.
ru: mappingInfo.Size содержит null.

# type_mapping_err__too_large_Size_2
source: Unexpected value of mappingInfo.Size: %1. Max allowed value: %2.
ru: Недопустимое значение mappingInfo.Size: %1. Максимально допустимое значение: %2.

# type_mapping_err__unexpected_IsFixedLength_2
source: Unexpected value of mappingInfo.IsFixedLength: %1. Expected value: %2.
ru: Недопустимое значение mappingInfo.IsFixedLength: %1. Ожидаемое значение: %2.

# type_mapping_err__unexpected_IsUnicode_2
source: Unexpected value of mappingInfo.IsUnicode: %1. Expected value: %2.
ru: Недопустимое значение mappingInfo.IsUnicode: %1. Ожидаемое значение: %2.

# type_mapping_err__unexpected_ClrType_2
source: Unexpected value of mappingInfo.ClrType: %1. Expected type: %2.
ru: Недопустимое значение mappingInfo.ClrType: %1. Ожидаемый тип: %2.

# type_mapping_err__unexpected_IsRowVersion_2
source: Unexpected value of mappingInfo.IsRowVersion: %1. Expected value: %2.
ru: Недопустимое значение mappingInfo.IsRowVersion: %1. Ожидаемое значение: %2.

# type_mapping_err__unexpected_Precision_1
source: Unexpected value of mappingInfo.Precision: %1.
ru: Недопустимое значение mappingInfo.Precision: %1.

# type_mapping_err__not_defined_Precision_0
source: mappingInfo.Precision contains null.
ru: mappingInfo.Precision содержит null.

# type_mapping_err__too_large_Precision_2
source: Unexpected value of mappingInfo.Precision: %1. Max allowed value: %2.
ru: Недопустимое значение mappingInfo.Precision: %1. Максимально допустимое значение: %2.

# type_mapping_err__not_allowed_definition_of_Scale_without_Precision_1
source: It is not allowed to definition the scale [%1] without precision.
ru: Не допускается указание масштаба [%1] без указания точности.

# type_mapping_err__unexpected_Scale_1
source: Unexpected value of mappingInfo.Scale: %1.
ru: Недопустимое значение mappingInfo.Scale: %1.

# type_mapping_err__not_defined_Scale_0
source: mappingInfo.Scale contains null.
ru: mappingInfo.Scale содержит null.

# type_mapping_err__too_large_Scale_2
source: Unexpected value of mappingInfo.Scale: %1. Max allowed value: %2.
ru: Недопустимое значение mappingInfo.Scale: %1. Максимально допустимое значение: %2.

# type_mapping_err__multiple_definition_of_type_property_3
source: Multiple definition of property [%1] value in datatype description. One value is [%2]. Second value is [%3].
ru: Многократное определение значения свойства [%1] в описании типа данных. Одно значение равно [%2]. Другое значение равно [%3].

# type_mapping_err__cant_convert_TimeSpan_to_database_format__out_of_range__4
source: Unable to convert TimeSpan value [%1] to format %2. Out of range - [%3 .. %4].
ru: Невозможно привести TimeSpan значение [%1] к формату %2. Выход за пределы допустимого диапазона значений - [%3 .. %4].

# type_mapping_err__cant_convert_database_value_to_TimeSpan__out_of_range__4
source: Unable to convert database value [%1] with format %2 to TimeSpan. Out of range - [%3 .. %4].
ru: Невозможно привести значение [%1] с форматом хранения в базе данных %2 к TimeSpan. Выход за пределы допустимого диапазона значений - [%3 .. %4].

# type_mapping_err__cn_dialect_does_not_support_usage_of_type_in_DDL_query_2
source: Current connection dialect [%1] does not allow usage a datatype [%2] in DDL queries.
ru: Текущий диалект подключения [%1] не разрешает использовать тип данных [%2] в DDL запросах.

# type_mapping_err__failed_to_parse_datatype_length_1
source: Failed to parse length of datatype [%1].
ru: Ошибка обработки длины типа данных [%1].

# type_mapping_err__failed_to_parse_datatype_precision_1
source: Failed to parse precision of datatype [%1].
ru: Ошибка обработки точности типа данных [%1].

# type_mapping_err__failed_to_parse_datatype_scale_1
source: Failed to parse scale of datatype [%1].
ru: Ошибка обработки масштаба типа данных [%1].

# type_mapping_err__too_large_length_of_datatype_1
source: Too large length of datatype [%1].
ru: Слишком большая длина типа данных [%1].

# type_mapping_err__too_large_precision_of_datatype_1
source: Too large precision of datatype [%1].
ru: Слишком большая точность типа данных [%1].

# type_mapping_err__too_large_scale_of_datatype_1
source: Too large scale of datatype [%1].
ru: Слишком большой масштаб типа данных [%1].

# type_mapping_err__incompleted_datatype_definition_0
source: Incompleted datatype definition.
ru: Незавершенное описание типа данных.

# type_mapping_err__incompleted_datatype_definition_1
source: Incompleted datatype definition [%1].
ru: Незавершенное описание типа данных [%1].

# type_mapping_err__bad_datatype_definition_1
source: Bad datatype definition [%1].
ru: Некорректное описание типа данных [%1].

# type_mapping_err__not_defined_charset_name_1
source: In datatype definition [%1] not defined a character set name.
ru: В описании типа данных [%1] не указано имя кодовой страницы.

# type_mapping_err__not_defined_subtype_name_1
source: In datatype definition [%1] not defined a subtype name.
ru: В описании типа данных [%1] не указано имя подтипа.

# type_mapping_err__unknown_blob_subtype_1
source: Unknown name of BLOB subtype: [%1].
ru: Неизвестное имя подтипа блоба: [%1].

# type_mapping_err__definition_of_blob_charset_allowed_only_for_subtype_text_0
source: Definition of BLOB charset allowed only for subtype TEXT.
ru: Указание кодовой страницы BLOB допускается только для подтипа TEXT.

# type_mapping_err__unexpected_data_at_end_of_datatype_definition_1
source: Unexpected data at end of datatype definition [%1].
ru: Неизвестные данные в конце определения типа данных [%1].

# schema_err__data_provider_not_support_req_restriction_2
source: Data provider does not support restriction [%2] for schema [%1].
ru: Провайдер данных не поддерживает ограничение [%2] для схемы [%1].

# schema_err__unknown_table_type__2
source: Unknown table type [%1]: [%2].
ru: Неизвестный тип таблицы [%1]: [%2].

# schema_err__unknown_proc_type__2
source: Unknown procedure type [%1]: [%2].
ru: Неизвестный тип процедуры [%1]: [%2].

# schema_err__failed_to_build_column_info_4
source: Failed to build info of column [%1].[%2].[%3].[%4].
ru: Ошибка формирования описания колонки [%1].[%2].[%3].[%4].

# schema_err__failed_to_build_parameter_info_4
source: Failed to build info of parameter [%1].[%2].[%3].[%4].
ru: Ошибка формирования описания параметра [%1].[%2].[%3].[%4].

# schema_err__failed_to_process_column_oledb_datatype_2
source: Failed to process column datatype. OLEDB Type Code: %1. OLEDB Column Flags: %2.
ru: Ошибка обработка типа данных колонки. OLEDB Type Code: %1. OLEDB Column Flags: %2.

# schema_err__failed_to_process_parameter_oledb_datatype_2
source: Failed to process parameter datatype. OLEDB Type Code: %1. OLEDB Flags: %2.
ru: Ошибка обработка типа данных параметра. OLEDB Type Code: %1. OLEDB Flags: %2.

# schema_err__provider_datatype_not_supported_1
source: Provider datatype [%1] not supported.
ru: Тип данных [%1] провайдера не поддерживается.

# schema_err__unknown_parameter_oledb_type_1
source: Unknown OLEDB type of parameter: %1.
ru: Неизвестный OLEDB тип параметра: %1.

# schema_err__unknown_data_type_1
source: Unknown datatype: %1.
ru: Неизвестный тип данных: %1.

# local_eval_err__member_not_supported_2
source: Local evaluation of member [%1].[%2] not supported.
ru: Локальное вычисление свойства [%1].[%2] не поддерживается.

# local_eval_err__unary_operator_not_supported_1
source: Local evaluation of unary operation [%1] not supported.
ru: Локальное вычисление унарной операции [%1] не поддерживается.

# local_eval_err__unary_operator_not_supported_2
source: Local evaluation of unary operation [%1] not supported. Linked value has type [%2].
ru: Локальное вычисление унарной операции [%1] не поддерживается. Связанное значение имеет тип [%2].

# local_eval_err__binary_operator_not_supported_3
source: Local evaluation of binary operation [%1] not supported. Left argument: [type: %2]. Right argument: [type: %3].
ru: Локальное вычисление бинарной операции [%1] не поддерживается. Левый аргумент: [тип: %2]. Правый аргумент: [тип: %3].

# local_eval_err__method_not_supported_1
source: Local evaluation of method [%1] not supported.
ru: Локальное вычисление метода [%1] не поддерживается.

# local_eval_err__unexpected_result_type_of_logical_expression_1
source: Unexpected result type of logical expression: %1.
ru: Неожиданный тип результата логического выражения: %1.

# local_eval_err__cant_remap_static_method_2
source: Can't remap method [%1] to method with arguments [%2].
ru: Невозможно переназначить метод [%1] на метод с аргументами [%2].

# local_eval_err__cant_remap_instance_method_3
source: Can't remap method [%1] to method of class [%2] with arguments [%3].
ru: Невозможно переназначить метод [%1] на метод класса [%2] с аргументами [%3].

# local_eval_err__ambiguous_remap_method_3
source: Ambiguous selection of method remapping [%1] for new arguments [%2]. Possible options:%3.
ru: Неоднозначный выбор переназначений метода [%1] для новых аргументов [%2]. Возможные варианты:%3.

# local_eval_err__cant_remap_object_construction_3
source: Can't transform creation of object with type [%1] to creation of object with type [%2]. Constructor with arguments [%3] not found.
ru: Не удалось преобразовать создание объекта с типом [%1] в создание объекта с типом [%2]. Не найден конструктор с параметрами [%3].

# local_eval_err__comparison_of_arrays_with_different_length_not_supported_2
source: Local comparison of linear arrays with different length not supported. First array length: %1. Second array length: %2.
ru: Локальное сравнение линейных массивов с разной длиной не поддерживается. Длина первого массива: %1. Длина второго массива: %2.

# local_eval_err__failed_to_compare_element_of_arrays_1
source: Failed to compare element [%1] of arrays.
ru: Ошибка сравнения элемента [%1] массивов.

# local_eval_err__cant_convert_array_element_value_to_required_type_3
source: Failed to convert array element value [index: %1] with type [%2] to type [%3].
ru: Ошибка приведения значения элемента массива [индекс: %1] с типом [%2] к типу [%3].

# com_err__com_code_error_1
source: The COM error code: %1.
ru: Код ошибки COM: %1.

# data_type_err__failed_to_build_data_type_sign_1
source: Failed to build string with definition of data type [%1].
ru: Ошибка формирования строки с описанием типа данных [%1].

# cs_utf16_err__bad_sequence__2
source: Bad UTF-16 symbols sequential. Offset [%2]. Check point [%1].
ru: Некорректная последовательность UTF-16 символов. Смещение [%2]. Точка проверки [%1].

# bug_check__generic_error_3
source: [BUG CHECK] Wrong state in check point [%1][%2]. Reason - %3.
ru: [BUG CHECK] Некорректное состояние в точке проверки [%1][%2]. Причина - %3.

# bug_check__deserialization__wrong_state_2
source: [BUG CHECK] Wrong state of deserialized object [%1]. Check point: "%2".
ru: [BUG CHECK] Некорректное состояние десериализированного объекта [%1]. Точка проверки: "%2".

# bug_check__deserialization__null_obj_ptr_2
source: [BUG CHECK] Wrong state of deserialized object [%1]. Restored the null pointer to object [%2].
ru: [BUG CHECK] Ошибка десериализации объекта [%1]. Восстановлен нулевой указатель на объект [%2].

# bug_check__deserialization__null_item_ptr_3
source: [BUG CHECK] Wrong state of deserialized object [%1]. Restored a null pointer in element [%3] of container [%2].
ru: [BUG CHECK] Ошибка десериализации объекта [%1]. Восстановлен нулевой указатель в элементе [%3] контейнера [%2].

# bug_check__array_err__unexpected_dim_number_6
source: [BUG CHECK] Unexpected dimension number of array [%1].[%2].[%3].[%4]: %5. Expected number: %6.
ru: [BUG CHECK] Неожиданный номер размерности массива [%1].[%2].[%3].[%4]: %5. Ожидался номер: %6.

# bug_check__array_err__bad_sort_of_schema_9
source: [BUG CHECK] Incorrect sort of schema [%1]. Previous element [%2].[%3].[%4].[%5]. Current element [%6].[%7].[%8].[%9].
ru: [BUG CHECK] Некорректная сортировка схемы [%1]. Предыдущий элемент [%2].[%3].[%4].[%5]. Текущий элемент [%6].[%7].[%8].[%9].

# bug_check__array_err__bad_range_of_dimension_7
source: [BUG CHECK] Incorrect range of dimension [%5] of array [%1].[%2].[%3].[%4]: %6..%7.
ru: [BUG CHECK] Некорректный диапазон размерности [%5] массива [%1].[%2].[%3].[%4]: %6..%7.

# bug_check__array_err__no_descr_4
source: [BUG CHECK] No description for array [%1].[%2].[%3].[%4].
ru: [BUG CHECK] Отсутствует описание массива [%1].[%2].[%3].[%4].

# bug_check__engine_svc_not_supported_1
source: [BUG CHECK] Service [id: %1] is not supported by current connection.
ru: [BUG CHECK] Сервис [id: %1] не поддерживается текущим подключением.

# bug_check__engine_svc_not_supported_req_interface_2
source: [BUG CHECK] Service [id: %1] is not supports the required interface [%2].
ru: [BUG CHECK] Сервис [id: %1] не поддерживает интерфейс [%2].

# bug_check__schema_contains_unexpected_row_count_4
source: [BUG CHECK] Unexpected row count in schema [%3]: %4. Check point: [%1][%2].
ru: [BUG CHECK] Неожиданное количество строк в схеме [%3]: %4. Точка проверки: [%1][%2].

# bug_check__incorrect_schema_restriction_number_5
source: [BUG CHECK] Incorrect number of restriction [%4] of metadata schema [%3]: %5. Check point: [%1][%2].
ru: [BUG CHECK] Некорректный номер ограничения [%4] схемы метаданных [%3]: %5. Точка проверки: [%1][%2].

# bug_check__unexpected_result_type_of_binary_operator_5
source: [BUG CHECK] Unexpected result type of binary operator [%1]: %2. Expected base type: %3. Left argument type: %4. Right argument type: %5.
ru: [BUG CHECK] Неожиданный тип результата бинарной операции [%1]: %2. Ожидаемый базовый тип: %3. Тип левого аргумента: %4. Тип правого аргумента: %5.

# bug_check__bind_to_type_method__not_found_4
source: [BUG CHECK] Failed to bind to method [%1].[%2] with parameter list {%3}. BindingFlags: %4. Method not found.
ru: [BUG CHECK] Ошибка привязки к методу [%1].[%2] со списком параметров {%3}. BindingFlags: %4. Метод не найден.

# bug_check__bind_to_type_method__bad_return_type_6
source: [BUG CHECK] Failed to bind to method [%1].[%2] with parameter list {%3}. BindingFlags: %4. Method returns %6 instead %5.
ru: [BUG CHECK] Ошибка привязки к методу [%1].[%2] со списком параметров {%3}. BindingFlags: %4. Метод возвращает %6 вместо %5.

# bug_check__get_nested_type__not_found_3
source: [BUG CHECK] Failed to get type of nested type [%1].[%2]. BindingFlags: %3. Type not found.
ru: [BUG CHECK] Ошибка получения описания вложенного типа [%1].[%2]. BindingFlags: %3. Тип не найден.

# bug_check__sql_enode__unsupported_arg_types__2
source: [BUG CHECK] SQL Expression Node [%1]. Unsupported argument types {%2}.
ru: [BUG CHECK] SQL Expression Node [%1]. Неподдерживаемые типы аргументов {%2}.
