Repository: ibprovider/Lcpi.EFCore.LcpiOleDb
Catalog: Code/Provider/Source/ErrorServices/ErrMessageID.*.resx
Languages: ru

# text__not_avail__tag_style
source: <not available>
ru: <не доступно>

# common_err__argument_is_null__2
source: Method "%1". Argument "%2" is null.
ru: Метод "%1". Аргумент "%2" содержит null.

# common_err__argument_is_not_null__2
source: Method "%1". Argument "%2" is not null [expected null].
ru: Метод "%1". Аргумент "%2" не содержит null [ожидается null].

# common_err__argument_is_empty__2
source: Method "%1". Argument "%2" is empty.
ru: Метод "%1". Аргумент "%2" не содержит данных.

# common_err__argument_is_negative__3
source: Method "%1". Argument "%2" contains negative value [%3].
ru: Метод "%1". Аргумент "%2" содержит отрицательное значение [%3].

# common_err__bad_argument_type_4
source: Method "%1". Bad value type of argument "%2": %3. Expected value with type: %4.
ru: Метод "%1". Недопустимый тип значения аргумента "%2": %3. Ожидается значение с типом: %4.

# common_err__bad_argument_list_size_3
source: Method "%1". Bad size of list in argument "%2": %3.
ru: Метод "%1". Некорректный размер списка в аргументе "%2": %3.

# common_err__bad_argument_list_size_4
source: Method "%1". Bad size of list in argument "%2": %3. Expected list size: %4.
ru: Метод "%1". Некорректный размер списка в аргументе "%2": %3. Ожидается список с размером: %4.

# common_err__object_was_disposed__1
source: Object [%1] was disposed.
ru: Доступ к ликвидированному объекту [%1] невозможен.

# common_err__object_was_disposed__cant_exec_method__2
source: Can't execute method [%2] of disposed object [%1].
ru: Вызов метода [%2] ликвидированного объекта [%1] невозможен.

# common_err__feature_not_supported__1
source: Feature [%1] not supported.
ru: Функциональность [%1] не поддерживается.

# common_err__method_not_impl__1
source: Method "%1" was not implemented.
ru: Метод "%1" не реализован.

# common_err__method_not_impl__2
source: Method "%1" was not implemented. Point [%2].
ru: Метод "%1" не реализован. Точка [%2].

# common_err__overflow_in_arithmetic_op1__3
source: Overflow in calculation of unary arithmetic operation [%1]. Argument: [%2] %3.
ru: Переполнение при вычислении унарной арифметической операции [%1]. Аргумент: [%2] %3.

# common_err__overflow_in_arithmetic_op2__5
source: Overflow in calculation of binary arithmetic operation [%1]. Left argument: [%2] %3. Right argument: [%4] %5.
ru: Переполнение при вычислении бинарной арифметической операции [%1]. Левый аргумент: [%2] %3. Правый аргумент: [%4] %5.

# common_err__out_of_range_in_arithmetic_op2__5
source: Result of arithmetic operation [%1] is out of range. Left argument: [%2] %3. Right argument: [%4] %5.
ru: Результат арифметической операции [%1] выходит за допустимый диапазон. Левый аргумент: [%2] %3. Правый аргумент: [%4] %5.

# common_err__index_out_of_range__2
source: The index [%1] of the element is out of range. Count of elements: %2.
ru: Индекс элемента [%1] вне допустимого диапазона. Количество элементов: %2.

# common_err__empty_list_of_values__0
source: Empty list of values.
ru: Пустой список значений.

# common_err__divide_by_zero__0
source: Divide by zero.
ru: Деление на ноль.

# common_err__cant_alloc_new_array__overflow__2
source: Failed to allocate array. Too many elements. Check point [%1][%2].
ru: Ошибка создания массива. Слишком большое число элементов. Точка проверки [%1][%2].

# common_err__unk_column_name__2
source: Table [%1] not contains the column with name [%2].
ru: Таблица [%1] не содержит колонку с именем [%2].

# common_err__invalid_column_value__4
source: Invalid value of column [index: %2][name: %3] of table [%1]: %4.
ru: Недопустимое значение колонки [индекс: %2][имя: %3] таблицы [%1]: %4.

# common_err__invalid_column_value_type__5
source: Invalid value type in column [index: %2][name: %3] of table [%1]: %4. Expected to value with type: %5.
ru: Недопустимый тип значения колонки [индекс: %2][имя: %3] таблицы [%1]: %4. Ожидалось значение с типом: %5.

# common_err__no_connection_object__0
source: No object of connection to database.
ru: Нет объект подключения к базе данных.

# common_err__unexpected_connection_object_type__2
source: Incorrect type of database connection object: [%1]. Expected to object with type: [%2].
ru: Некорректный тип объекта подключения к базе данных: [%1]. Ожидался объект с типом: [%2].

# common_err__unexpected_connection_state_1
source: Unexpected state of connection object: %1.
ru: Неизвестное состояние объекта подключения: %1.

# common_err__failed_to_read_connection_properties_0
source: Failed to read connection properties.
ru: Ошибка чтения свойств подключения.

# common_err__connection_object_contains_empty_connection_string_0
source: Connection object contains empty connection string.
ru: Объект подключения содержит пустую строку подключения.

# common_err__no_source_for_load_connection_info_0
source: No source for loading a connection information.
ru: Отсутствует источник для загрузки сведений о подключении.

# common_err__object_already_initialized_0
source: Object already initialized.
ru: Объект уже был инициализирован.

# common_err__extension_not_found_1
source: Extension [%1] not found.
ru: Расширение [%1] не найдено.

# common_err__cant_work_with_uninitialized_object_1
source: Can't call [%1] of uninitialized object.
ru: Не допускается вызов [%1] неинициализированного объекта.

# common_err__zero_symbol_in_string_literal_1
source: Zero symbol [position: %1] in string literal.
ru: Нулевой символ [позиция: %1] в текстовом значении.

# common_err__unknown_dbms_name_1
source: Unknown DBMS name: [%1].
ru: Неизвестное имя сервера баз данных: [%1].

# common_err__unsupported_dbms_version_2
source: Unsupported version of DBMS [%1]: [%2].
ru: Неподдерживаемая версия сервера баз данных [%1]: [%2].

# common_err__unsupported_connection_dialect_1
source: Unsupported connection dialect [%1].
ru: Неподдерживаемый диалект подключения [%1].

# common_err__empty_object_name_0
source: Empty object name.
ru: Пустое имя объекта.

# common_err__bad_symbol_in_unquoted_object_name_2
source: Bad symbol in unquoted object name [position: %1, char code: %2].
ru: Недопустимый символ в неквотированном имени объекта [позиция: %1, код символа: %2].

# common_err__bad_symbol_in_quoted_object_name_2
source: Bad symbol in quoted object name [position: %1, char code: %2].
ru: Недопустимый символ в квотированном имени объекта [позиция: %1, код символа: %2].

# common_err__not_defined_cmd_parameter_prefix_0
source: Not defined named parameter prefix.
ru: Не определен префикс именованных параметров.

# common_err__no_provider_configured_0
source: No configuration for LcpiOleDb provider.
ru: Отсутствует конфигурация провайдера LcpiOleDb.

# common_err__multiple_provider_configured_0
source: Multiple configurations for LcpiOleDb provider.
ru: Несколько конфигураций провайдера LcpiOleDb.

# common_err__unsupported_datatypes_conversion_2
source: Conversion of value from [%1] to [%2] does not supported.
ru: Конвертирование значения из типа [%1] в тип [%2] не поддерживается.

# common_err__cant_convert_value_between_types_2
source: Failed to convert a value from type [%1] to type [%2].
ru: Ошибка конвертирования значения из типа [%1] в тип [%2].

# common_err__target_property_not_accept_null_value_0
source: Target property does not allow NULL value.
ru: Целевое свойство не допускает установку NULL-значений.

# common_err__failed_to_set_property_value_3
source: Failed to set value of property [%1][%2], which linked to column [%3].
ru: Ошибка установки значения свойства [%1].[%2], привязанного к колонке [%3].

# common_err__unexpected_command_param_direction_2
source: Unexpected direction of command parameter [%1]: %2.
ru: Неожиданное направление параметра команды [%1]: %2.

# common_err__no_command_param_value_1
source: No value of command parameter [%1].
ru: Не определено значение параметра команды [%1].

# common_err__direct_call_of_linq_method_not_allowed_1
source: Direct call of method [%1] not allowed. You may call this method in linq-expressions only.
ru: Непосредственный вызов метода [%1] не допускается. Вы можете его вызывать только через linq-выражения.

# common_err__failed_to_process_value_1
source: Failed to process value [%1].
ru: Ошибка обработки значения [%1].

# common_err__overflow_in_number_scale_calculation_0
source: Overflow in calculation of number scale.
ru: Переполнение при вычислении масштаба числа.

# common_err__ConflictingRowValuesSensitive_6
source: Instances of entity types '%1' and '%2' are mapped to the same row with the key value %3, but have different property values %4 and %5 for the column '%6'.
ru: Экземпляры Entity типов '%1' и '%2' отображаются на одну и ту же запись с ключом %3, но имеют разные значения %4 / %5 для колонки '%6'.

# common_err__ConflictingRowValues_5
source: Instances of entity types '%1' and '%2' are mapped to the same row, but have different property values for the properties %3 and %4 mapped to '%5'. Consider using 'DbContextOptionsBuilder.EnableSensitiveDataLogging' to see the conflicting values.
ru: Экземпляры Entity типов '%1' и '%2' отображаются на одну и ту же запись, но имеют разные значения свойств %3 / %4 для колонки '%5'. Настройте 'DbContextOptionsBuilder.EnableSensitiveDataLogging' для просмотра конфликтующих значений.

# common_err__ConflictingOriginalRowValuesSensitive_6
source: Instances of entity types '%1' and '%2' are mapped to the same row with the key value %3, but have different original property values %4 and %5 for the column '%6'.
ru: Экземпляры Entity типов '%1' и '%2' отображаются на одну и ту же запись и туже запись с ключом %3, но имеют разные исходные значения %4 / %5 для колонки '%6'.

# common_err__ConflictingOriginalRowValues_5
source: Instances of entity types '%1' and '%2' are mapped to the same row, but have different original property values for the properties %3 and %4 mapped to '%5'. Consider using 'DbContextOptionsBuilder.EnableSensitiveDataLogging' to see the conflicting values.
ru: Экземпляры Entity типов '%1' и '%2' отображаются на одну и ту же запись, но имеют разные исходные значения %3 / %4 для колонки '%5'. Настройте 'DbContextOptionsBuilder.EnableSensitiveDataLogging' для просмотра конфликтующих значений.

# common_err__type_not_support_method_3
source: Type %1 does not provide a method %2 with parameters (%3).
ru: Тип %1 не предоставляет метод %2 с аргументами (%3).

# common_err__cant_remap_normal_method_3
source: Can't remap method [%1] to method of class %2 with parameters (%3).
ru: Не получается отобразить метод [%1] на метод класса %2 c параметрами (%3).

# common_err__cant_remap_generic_method_4
source: Can't remap method [%1] to method of class %2 with parameters <%4>(%3).
ru: Не получается отобразить метод [%1] на метод класса %2 c параметрами <%4>(%3).

# common_err__bad_cmd_parameter_name_format_1
source: Bad format of command parameter name: [%1].
ru: Некорректный формат имени параметра команды: [%1].

# common_err__bad_cmd_parameter_name_format__incorrect_prefix_1
source: Bad format of command parameter name, incorrect prefix: [%1].
ru: Некорректный формат имени параметра команды, неправильный префикс: [%1].

# common_err__unknown_annotation__1
source: Unknown annotation [%1].
ru: Неизвестная аннотация [%1].

# common_err__annotation_has_unknown_value__2
source: Annotation [%1] has unknown value: [%2].
ru: Аннотация [%1] имеет неизвестное значение: [%2].

# common_err__annotation_has_null_value__1
source: Annotation [%1] has null value.
ru: Аннотация [%1] имеет null-значение.

# common_err__annotation_has_value_with_unexpected_type__3
source: Annotation [%1] has value with unexpected type: [%2]. Expected type: [%3].
ru: Аннотация [%1] имеет значение с неизвестным типом: [%2]. Ожидаемый тип: [%3].

# common_err__annotation_has_value_with_unexpected_type__2
source: Annotation [%1] has value with unexpected type: [%2].
ru: Аннотация [%1] имеет значение с неизвестным типом: [%2].

# common_err__multiple_definition_of_annotation__3
source: Annotation [%1] already defined with value [%2]. New value: [%3].
ru: Аннотация [%1] уже определена со значением [%2]. Новое значение: [%3].

# common_err__model_defines_incorrect_global_value_generation_strategy__1
source: Model defines incorrect global value generation strategy [%1].
ru: Модель определяет некорректную глобальную стратегию генерации значений [%1].

source: Property [%3] with datatype [%4] is not compatible with value generation strategy [%1]. Property declared in type %2.
ru: Свойство [%3] с типом данных [%4] несовместимо со стратегией генерации значений [%1]. Свойство определено в типе %2.

# common_err__value_generation_strategy_cant_be_defined_at_model_level__1
source: Value generation strategy [%1] can't be defined at data model level.
ru: Стратегия генерации значений [%1] не может быть определена на уровне модели данных.

# common_err__entity_property_has_conflict_of_value_generation_strategies__4
source: Both the value generation strategy [%3] and [%4] have been set on property [%2] of entity type [%1].
ru: Свойство [%2] cущности (entity) [%1] определяет конфликтующие стратегии генерации значения: [%3] и [%4].

# dbms_err__fb__firebird_does_not_support_non_cyclic_sequence__1
source: Firebird does not support sequence with control of cycling. Setup in definition of sequence [%1] a value of property IsCyclic equal to true.
ru: Firebird не поддерживает последовательности значений (SEQUENCE) с контролем зацикливания. Установите в определении последовательности [%1] значение свойства IsCyclic равным true.

# dbms_err__fb__firebird_does_not_support_configuration_of_sequence_bound_value__3
source: Firebird does not support configuration of sequence property %1. Setup in definition of sequence [%2] a value of property %1 equal to NULL or %3.
ru: Firebird не поддерживает конфигурирование свойства %1 у последовательнсти значений (SEQUENCE). Установите в определении последовательности [%2] значение свойства %1 равным NULL или %3.

# dbms_err__fb__firebird_does_not_support_drop_identity_attribute_from_column__0
source: Firebird does not support removing IDENTITY attribute from table column.
ru: Firebird не поддерживает удаление атрибута IDENTITY у колонки таблицы.

# dbms_err__fb__firebird_does_not_support_add_identity_attribute_to_column__0
source: Firebird does not support adding IDENTITY attribute to table column.
ru: Firebird не поддерживает добавления атрибута IDENTITY к колонке таблицы.

# dbms_err__fb__firebird_does_not_support_renaming_of_tables__0
source: Firebird does not support renaming of tables.
ru: Firebird не поддерживает переименование таблиц.

# dbms_err__fb__firebird_does_not_support_renaming_of_sequences__0
source: Firebird does not support renaming of sequences.
ru: Firebird не поддерживает переименование последовательностей значений (SEQUENCES).

# dbms_err__fb__firebird_does_not_support_renaming_of_indexes__0
source: Firebird does not support renaming of indexes.
ru: Firebird не поддерживает переименование индексов.

# dbms_err__fb__firebird_does_not_support_schemas__0
source: Firebird does not support schemas.
ru: Firebird не поддерживает схемы.

# validation_err__failed_to_entity_validation_1
source: Failed to validate entity [%1].
ru: Ошибка проверки cущности (entity) [%1].

# validation_err__failed_to_entity_property_validation_2
source: Failed to validate entity property [%1]::[%2].
ru: Ошибка проверки свойства cущности (entity) [%1]::[%2].

# sql_translator_err__method_not_supported_1
source: Failed translation to SQL. Method %1 not supported.
ru: Ошибка трансляции в SQL. Метод %1 не поддерживается.

# sql_translator_err__member_not_supported_2
source: Failed translation to SQL. Member [%1].[%2] not supported.
ru: Ошибка трансляции в SQL. Свойство [%1].[%2] не поддерживается.

# sql_translator_err__unsupported_binary_operator_type_1
source: Failed translation to SQL. Unsupported binary operation type: %1.
ru: Ошибка трансляции в SQL. Неподдерживаемый тип бинарной операции: %1.

# sql_translator_err__unsupported_binary_operator_type_3
source: Failed translation to SQL. Unsupported binary operation type: %1. Left argument type: %2. Right argument type: %3.
ru: Ошибка трансляции в SQL. Неподдерживаемый тип бинарной операции: %1. Тип левого аргумента: %2. Тип правого аргумента: %3.

# sql_translator_err__unsupported_unary_operator_type_1
source: Failed translation to SQL. Unsupported unary operation type: %1.
ru: Ошибка трансляции в SQL. Неподдерживаемый тип унарной операции: %1.

# sql_translator_err__unsupported_unary_operator_type_3
source: Failed translation to SQL. Unsupported unary operation type: %1. Argument type: %2. Result type: %3.
ru: Ошибка трансляции в SQL. Неподдерживаемый тип унарной операции: %1. Тип аргумента: %2. Тип результата: %3.

# sql_translator_err__cant_present_unary_operation_as_SqlUnaryExpression_3
source: SQL-translation of unary operation [%1][operand: %2][result: %3] is supported, but can't be present as SqlUnaryExpression class.
ru: SQL-трансляция унарной операции [%1][аргумент: %2][результат: %3] поддерживается, но не может быть представлена в виде класса SqlUnaryExpression.

# sql_translator_err__cant_present_binary_operation_as_SqlBinaryExpression_3
source: SQL-translation of binary operation [%1][left: %2][right: %3] is supported, but can't be present as SqlBinaryExpression class.
ru: SQL-трансляция бинарной операции [%1][left: %2][right: %3] поддерживается, но не может быть представлена в виде класса SqlBinaryExpression.

# sql_translator_err__cant_present_function_as_SqlFunctionExpression_1
source: SQL-translation of function [%1] is supported, but can't be present as SqlFunctionExpression class.
ru: SQL-трансляция функции [%1] поддерживается, но не может быть представлена в виде класса SqlFunctionExpression.

# sql_gen_err__unsupported_cast_as_between_types_2
source: Generation of SQL-operator "CAST AS" for conversion from type [%1] to type [%2] is not supported.
ru: Генерация SQL-оператора "CAST AS" для преобразования типа [%1] в тип [%2] не поддерживается.

# sql_gen_err__translation_of_member_not_supported_in_current_cn_dialect_2
source: SQL-translation of member [%2] not supported by current database connection dialect [%1].
ru: SQL-трансляция конструкции [%2] не поддерживается текущим диалектом подключения [%1] к базе данных.

# sql_gen_err__decimal_precision_not_supported_in_current_cn_dialect_3
source: Precision [%3] of SQL data type [%2] not supported by current database connection dialect [%1].
ru: Точность [%3] SQL типа данных [%2] не поддерживается текущим диалектом подключения [%1] к базе данных.

# sql_gen_err__definition_of_value_in_sql_not_supported__1
source: Pass of value with type [%1] as text in SQL is not supported. Try to pass this value through parameter.
ru: Передача значения с типом [%1] в тексте SQL запроса не поддерживается. Попробуйте передать это значение через параметр.

# sql_gen_err__not_supported_sql_operator__1
source: Translating this query requires the SQL-operation [%1], which is not supported.
ru: Трансляция этого запроса требует SQL-оператор [%1], который не поддерживается.

# msql_gen_err__failed_to_generate_table_definition__1
source: Failed to generate a definition of table [%1].
ru: Ошибка генерации определения таблицы [%1].

# msql_gen_err__failed_to_generate_column_definition__2
source: Failed to generate a definition of column [%1][%2].
ru: Ошибка генерации определения колонки [%1][%2].

# msql_gen_err__computed_column_not_supported__0
source: Generation of SQL for computed column does not supported.
ru: Генерация SQL для вычисляемого столбца не поддерживается.

# msql_gen_err__cant_find_type_mapping_for_column__2
source: Can't find type description (TypeMapping) for column [%1][%2].
ru: Не найдено описание типа (TypeMapping) для колонки [%1][%2].

# msql_gen_err__cant_find_type_mapping_for_default_value__1
source: Can't find type description (TypeMapping) for default value with CLR-type [%1].
ru: Не найдено описание типа (TypeMapping) для значения по умолчанию с CLR-типом [%1].

# msql_gen_err__detected_multiple_definition_of_default_value__0
source: Detected multiple variants with definition of default value. Please use only one option.
ru: Указано несколько вариантов с определением значения по умолчанию. Используйте только один.

# msql_gen_err__identity_column_cant_be_created_with_required_data_type__2
source: Invalid IDENTITY-column datatype [clrType: %1][sqlType: %2].
ru: Недопустимый тип данных IDENTITY-колонки [clrType: %1][sqlType: %2].

# msql_gen_err__identity_column_cant_be_has_default_value__0
source: It is not allowed to specify a DEFAULT value for an IDENTITY-column.
ru: Недопускается указание DEFAULT значения у IDENTITY-колонки.

# msql_gen_err__identity_column_cant_be_nullable__0
source: IDENTITY-column can't be nullable.
ru: IDENTITY-колонка не может быть nullable.

# msql_gen_err__failed_to_generate_fk_definition__3
source: Failed to generate a definition of foreign key [table: %1][fk: %2][foreign table: %3].
ru: Ошибка генерации определения внешнего ключа [таблица: %1][fk: %2][внешняя таблица: %3].

# msql_gen_err__bad_fk_definition__different_size_of_column_lists__2
source: Different column count in lists of foreign key definition: %1 and %2.
ru: Разное число колонок в списках определения внешнего ключа: %1 и %2.

# msql_gen_err__unknown_fk_referential_action__1
source: Unknown identifier of foreign key referential action: %1.
ru: Неизвестный идентификатор ссылочного правила внешнего ключа: %1.

# msql_gen_err__failed_to_generate_create_sequence_statement__1
source: Failed to generate CREATE SEQUENCE [%1] statement.
ru: Ошибка генерации запроса CREATE SEQUENCE [%1].

# msql_gen_err__failed_to_generate_restart_sequence_statement__1
source: Failed to generate ALTER SEQUENCE [%1] RESTART statement.
ru: Ошибка генерации запроса ALTER SEQUENCE [%1] RESTART.

# msql_gen_err__failed_to_generate_alter_sequence_statement__1
source: Failed to generate ALTER SEQUENCE [%1] statement.
ru: Ошибка генерации запроса ALTER SEQUENCE [%1].

# msql_gen_err__overflow_in_calculation_of_adjusted_sequence_start_value__3
source: Overflow when calculating the adjusted SEQUENCE [%1] initial value. User data - [startValue: %2][incrementBy: %3].
ru: Переполнение в процессе вычисления откорректированного начального значения SEQUENCE [%1]. Пользовательские данные - [startValue: %2][incrementBy: %3].

# msql_gen_err__unexpected_sequence_ClrType__3
source: Unexpected clr type of sequence [%1]: %2. Expected clr type: %3.
ru: Недопустимый clr тип последовательности (sequence) [%1]: %2. Ожидаемый clr тип: %3.

# msql_gen_err__incorrect_sequence_start_value__4
source: Invalid start value of sequence [%1]: %2. Minimal value: %3. Maximal value: %4.
ru: Недопустимое начальное значение последовательности значение (SEQUENCE) [%1]: %2. Минимальное значение: %3. Максимальное значение: %4.

# msql_gen_err__inconsistent_table_names_in_alter_column_operation__2
source: Inconsistent table names in ALTER COLUMN operation. Old data table name: [%1]. New data table name: [%2].
ru: Несогласованные названия таблиц в операции ALTER COLUMN. Имя таблицы в старых данных: [%1]. Имя таблицы в новых данных: [%2].

# msql_gen_err__failed_to_generate_alter_column_statement__3
source: Failed to generate ALTER COLUMN [table: %1][new column: %2][old column: %3] statement.
ru: Ошибка генерации запроса ALTER COLUMN [table: %1][new column: %2][old column: %3].

# msql_gen_err__failed_to_generate_table_creation_script__1
source: Failed to generate script for creation of table [%1].
ru: Ошибка генерации скрипта для создания таблицы [%1].

# msql_gen_err__column_data_uses_incorrect_table_name__4
source: Incorrect table name in description of column [index: %1][name: %2]: [%3]. Expected table name [%4].
ru: Некорректное имя таблицы в описании колонки [индекс: %1][имя: %2]: [%3]. Ожидается имя таблицы [%4].
